&НаКлиенте
Процедура ПродукцияЦенаПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки()
	
    // ВНИМАНИЕ: Продукция — это имя элемента (таблицы) на форме
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
        Количество = ?(ТекущиеДанные.Количество = Неопределено, 0, ТекущиеДанные.Количество);
        Цена = ?(ТекущиеДанные.Цена = Неопределено, 0, ТекущиеДанные.Цена);
        
		// Выполняем расчет и записываем результат в реквизит "Сумма"
		ТекущиеДанные.Сумма = Количество * Цена;
		
	КонецЕсли;
	
КонецПроцедуры