Процедура ПередЗаписью(Отказ, РежимЗаписи, ТекущаяОбласть)
    
    Если РежимЗаписи Тогда
    	
        // При изменении существующих записей
        Если ТекущаяОбласть = Неопределено Тогда
            Возврат;
        КонецЕсли;
        
        // Проверяем нет ли уже такого шаблона
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    ШаблоныЗаказов.Клиент,
        |    ШаблоныЗаказов.Продукция
        |ИЗ
        |    РегистрСведений.ШаблоныЗаказов КАК ШаблоныЗаказов
        |ГДЕ
        |    ШаблоныЗаказов.Клиент = &Клиент
        |    И ШаблоныЗаказов.Продукция = &Продукция";
        
        Запрос.УстановитьПараметр("Клиент", ТекущаяОбласть.Клиент);
        Запрос.УстановитьПараметр("Продукция", ТекущаяОбласть.Продукция);
        
        Результат = Запрос.Выполнить();
        
        Если НЕ Результат.Пустой() Тогда
            Отказ = Истина;
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Шаблон заказа для данного клиента и продукции уже существует!";
            Сообщение.Сообщить();
            Возврат;
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

