Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ЭтотОбъект.Подтвержден = Ложь;

    СуммаЗаказа = 0;
    Для Каждого СтрокаТЧ Из Продукция Цикл
        СуммаЗаказа = СуммаЗаказа + СтрокаТЧ.Сумма;
    КонецЦикла;

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЕСТЬNULL(Взаиморасчеты.СуммаДолгаОстаток, 0) КАК ТекущийДолг
        |ИЗ
        |   РегистрНакопления.ВзаиморасчетыСКлиентами.Остатки( , Клиент = &Клиент) КАК Взаиморасчеты";
    
    Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Клиент); 
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    СуммаДолгаКлиента = 0;
    Если Выборка.Следующий() Тогда
        СуммаДолгаКлиента = Выборка.ТекущийДолг;
    КонецЕсли;

    МинимальнаяСумма = 500;
    МаксимальныйДолг = 2000;

    Если СуммаЗаказа > МинимальнаяСумма И СуммаДолгаКлиента <= МаксимальныйДолг Тогда
        Подтвержден = Истина;
    Иначе
        Подтвержден = Ложь;
    КонецЕсли;

    ЭтотОбъект.Подтвержден = Подтвержден;

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Проверяем, подтвержден ли заказ
    Если Не ЭтотОбъект.Подтвержден Тогда
        Возврат;
    КонецЕсли;

    // Создаем документ ОтгрузкаКлиенту
    Попытка

        НоваяОтгрузка = Документы.ОтгрузкаКлиенту.СоздатьДокумент();

        // Заполняем реквизиты шапки
        НоваяОтгрузка.Клиент = ЭтотОбъект.Клиент;
        НоваяОтгрузка.Дата = ТекущаяДата();

		СуммаЗаказа = 0;
        // Копируем табличную часть
        Для Каждого СтрокаЗаказа Из Продукция Цикл
            НоваяСтрока = НоваяОтгрузка.Продукция.Добавить();
            НоваяСтрока.Продукция  = СтрокаЗаказа.Продукция;
            НоваяСтрока.Количество = СтрокаЗаказа.Количество;
            НоваяСтрока.Цена       = СтрокаЗаказа.Цена;
            НоваяСтрока.Сумма      = СтрокаЗаказа.Сумма;
            СуммаЗаказа = СуммаЗаказа + СтрокаЗаказа.Сумма;
        КонецЦикла;

        НоваяОтгрузка.Записать();

		Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	    Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
	    Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
	    Движение.Период      = Дата;
	    Движение.Клиент      = ЭтотОбъект.Клиент;
    	Движение.СуммаДолга  = СуммаЗаказа;

    Исключение
        Сообщить("Внимание! Автоматическая отгрузка не была создана: " + ОписаниеОшибки(), СтатусСообщения.Важное);
    КонецПопытки;

КонецПроцедуры
