Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ОстаткиПродукции.Записывать = Истина;
    
    Для Каждого СтрокаТЧ Из Продукция Цикл
        
        // Приход готовой продукции
        Движение = Движения.ОстаткиПродукции.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = ДатаВыпуска;
        Движение.Продукция = СтрокаТЧ.Продукция;
        Движение.Количество = СтрокаТЧ.Выпущено;
        
        // Списание брака
        Движение = Движения.ОстаткиПродукции.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = ДатаВыпуска;
        Движение.Продукция = СтрокаТЧ.Продукция;
        Движение.Количество = СтрокаТЧ.Брак;
        
    КонецЦикла;
  
КонецПроцедуры