
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	 Объект.Продукция.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПродукцияПриИзменении(Элемент)
	
	Элементы.Продукция.ТекущиеДанные.Цена = РаботаСоСправочниками.ЦенаНаПродукцию(Объект.Дата, Объект.Клиент, Элементы.Продукция.ТекущиеДанные.Продукция);
	Если  Элементы.Продукция.ТекущиеДанные.Количество = 0 Тогда
		 Элементы.Продукция.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	Элементы.Продукция.ТекущиеДанные.Сумма = Элементы.Продукция.ТекущиеДанные.Количество * Элементы.Продукция.ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	строка = Элементы.Продукция.ТекущиеДанные;
	строка.Сумма = строка.Количество * строка.Цена
КонецПроцедуры
